In [1]:
import pandas as pd

### Task 1. Read usedcars.csv

In [2]:
df = pd.read_csv('./data/usedcars.csv')
df

     year model  price  mileage   color transmission
0    2011   SEL  21992   7413.0  Yellow         AUTO
1    2011   SEL  20995  10926.0    Gray         AUTO
2    2011   SEL  19995   7351.0  Silver         AUTO
3    2011   SEL  17809  11613.0    Gray         AUTO
4    2012    SE  17500   8367.0   White         AUTO
..    ...   ...    ...      ...     ...          ...
145  2006   SES   6200      NaN  Silver         AUTO
146  2002    SE   5995      NaN     Red         AUTO
147  2000    SE   5980      NaN     Red         AUTO
148  2001    SE   4899      NaN  Yellow         AUTO
149  2000    SE   3800      NaN     Red         AUTO

[150 rows x 6 columns]

### Task 2. Show summary using head(), tail(), info() and describe()

In [3]:
df.head()

   year model  price  mileage   color transmission
0  2011   SEL  21992   7413.0  Yellow         AUTO
1  2011   SEL  20995  10926.0    Gray         AUTO
2  2011   SEL  19995   7351.0  Silver         AUTO
3  2011   SEL  17809  11613.0    Gray         AUTO
4  2012    SE  17500   8367.0   White         AUTO

In [4]:
df.tail()

     year model  price  mileage   color transmission
145  2006   SES   6200      NaN  Silver         AUTO
146  2002    SE   5995      NaN     Red         AUTO
147  2000    SE   5980      NaN     Red         AUTO
148  2001    SE   4899      NaN  Yellow         AUTO
149  2000    SE   3800      NaN     Red         AUTO

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          150 non-null    int64
 1   model         150 non-null    object
 2   price         150 non-null    int64
 3   mileage       129 non-null    float64
 4   color         150 non-null    object
 5   transmission  150 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 7.2+ KB

In [6]:
df.describe()

              year         price        mileage
count   150.000000    150.000000     129.000000
mean   2008.993333  14242.353333   37531.666667
std       3.288166   9773.811205   20122.776366
min    2000.000000   3800.000000    4867.000000
25%    2008.000000  10995.000000   24920.000000
50%    2009.000000  13631.000000   35574.000000
75%    2010.000000  14989.750000   44518.000000
max    2030.000000  90000.000000  127327.000000

### Task 3. Change name of columns

In [9]:
df.columns # checking the name of columns

Index(['year', 'model', 'price', 'mileage', 'color', 'transmission'], dtype='object')

In [12]:
df.rename(columns = {
    'year': 'years',
    'price': 'cost'
}, inplace=True)

df.columns

Index(['years', 'model', 'cost', 'mileage', 'color', 'transmission'], dtype='object')

### Task 4. Perform at least three loc and iloc data manipulation

In [18]:
# loc
print(df.loc[:, 'years'])
print('-' * 20)
print(df.loc[:, ['years', 'cost']])
print('-' * 20)
print(df.loc[4:9, :])

0      2011
1      2011
2      2011
3      2011
4      2012
       ...
145    2006
146    2002
147    2000
148    2001
149    2000
Name: years, Length: 150, dtype: int64
--------------------
     years   cost
0     2011  21992
1     2011  20995
2     2011  19995
3     2011  17809
4     2012  17500
..     ...    ...
145   2006   6200
146   2002   5995
147   2000   5980
148   2001   4899
149   2000   3800

[150 rows x 2 columns]
--------------------
   years model   cost  mileage   color transmission
4   2012    SE  17500   8367.0   White         AUTO
5   2010   SEL  17495  25125.0  Silver         AUTO
6   2011   SEL  17000  27393.0    Blue         AUTO
7   2010   SEL  16995  21026.0  Silver         AUTO
8   2011   SES  16995  32655.0  Silver         AUTO
9   2010   SES  16995  36116.0  Silver         AUTO

In [19]:
# iloc
print(df.iloc[3:5, 2:3])
print('-' * 20)
print(df.iloc[:])
print('-' * 20)
print(df.iloc[1:5, 0:5:2])

    cost
3  17809
4  17500
--------------------
     years model   cost  mileage   color transmission
0     2011   SEL  21992   7413.0  Yellow         AUTO
1     2011   SEL  20995  10926.0    Gray         AUTO
2     2011   SEL  19995   7351.0  Silver         AUTO
3     2011   SEL  17809  11613.0    Gray         AUTO
4     2012    SE  17500   8367.0   White         AUTO
..     ...   ...    ...      ...     ...          ...
145   2006   SES   6200      NaN  Silver         AUTO
146   2002    SE   5995      NaN     Red         AUTO
147   2000    SE   5980      NaN     Red         AUTO
148   2001    SE   4899      NaN  Yellow         AUTO
149   2000    SE   3800      NaN     Red         AUTO

[150 rows x 6 columns]
--------------------
   years   cost   color
1   2011  20995    Gray
2   2011  19995  Silver
3   2011  17809    Gray
4   2012  17500   White

### Task 5. Perform at least three conditional data manipulation

In [21]:
print(df[df['years'] >= 2012]) # first performing

    years model   cost  mileage  color transmission
4    2012    SE  17500   8367.0  White         AUTO
12   2030   SEL  16950   9388.0  Green         AUTO
53   2030    SE  13999  23785.0    Red         AUTO

In [23]:
print(df[(df['years'] == 2030) & (df['color'] == 'Red')]) # second performing

    years model   cost  mileage color transmission
53   2030    SE  13999  23785.0   Red         AUTO

In [31]:
print(df[df['cost'] >= 50000][['years', 'model', 'cost']]) # final performing

    years model   cost
19   2011   SEL  90000
65   2010    SE  75000
83   2010    SE  70000

### Task 6. Challenging task: Create a new column and add it to your dataframe

In [32]:
data = {'Name': pd.Series(['Yeongmin Ko', 'Minjae Kim', 'Piggy Mon', 'Gildong Hong']),
        'Korean': pd.Series([100, 90, 80, 70]),
        'Math': pd.Series([100, 85, 70, 50]),
        'English': pd.Series([100, 70, 50, 65])}

df = pd.DataFrame(data)
df.head()

           Name  Korean  Math  English
0   Yeongmin Ko     100   100      100
1    Minjae Kim      90    85       70
2     Piggy Mon      80    70       50
3  Gildong Hong      70    50       65

In [39]:
df['Total'] = df[['Korean', 'Math', 'English']].sum(axis=1)
df

           Name  Korean  Math  English  Total
0   Yeongmin Ko     100   100      100    300
1    Minjae Kim      90    85       70    245
2     Piggy Mon      80    70       50    200
3  Gildong Hong      70    50       65    185

In [40]:
df['Mean'] = df['Total'] / 3
df

           Name  Korean  Math  English  Total        Mean
0   Yeongmin Ko     100   100      100    300  100.000000
1    Minjae Kim      90    85       70    245   81.666667
2     Piggy Mon      80    70       50    200   66.666667
3  Gildong Hong      70    50       65    185   61.666667

In [41]:
df[df['Mean'] > 80]

          Name  Korean  Math  English  Total        Mean
0  Yeongmin Ko     100   100      100    300  100.000000
1   Minjae Kim      90    85       70    245   81.666667

In [45]:
df.sort_values(by = 'English', ascending = False)

           Name  Korean  Math  English  Total        Mean
0   Yeongmin Ko     100   100      100    300  100.000000
1    Minjae Kim      90    85       70    245   81.666667
3  Gildong Hong      70    50       65    185   61.666667
2     Piggy Mon      80    70       50    200   66.666667